source/blog/2018-02-26-computer-network.org
#+TITLE: 计算机网络
#+DATE: 2018-02-26
#+SETUPFILE: ~/blog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: notes
#+JEKYLL_TAGS: 学习笔记
#+JEKYLL_PUBLISHED: true

* 计算机网络概论
** 计算机网络
*** 定义
由通信信道连接的 *主机和网络设备* 的集合，以方便用户共享资源和互相通信。
*** 特征
- *最主要特征* 是通用性，没有对特定应用进行优化
- 能够支持广泛的、不断出现的新型应用
*** 用途
- 共享信息
- 协同计算
- 方便通信
- 共享硬件
*** 组成
**** 称为节点的计算设备
***** 端系统（主机）
***** 中间节点
路由器，交换机，自治系统，虚拟节点等。
**** 称为链路的物理媒体
*** 连接方式
- 直接连接
- 网络云
- 网络云互联
*** 传递数据的方式
**** 电路交换（电话网）
*基本过程*
1. 建立连接
2. 传输数据
3. 连接释放

*优点* 独占资源，通信质量有保证，延迟小，无拥塞
*缺点* 建立连接时间长，工作复杂，有时工作效率低
**** 分组交换（计算机网络）
- 首先采用存储转发机制
- 将长数据划分为若干短数据形成分组
以上两条为 *计算机网络最根本工作机制*
**** 报文交换
*优点* 无连接，采用存储转发
*缺点* 对报文大小无限制，有时占用中间节点空间大，延时大
*** 网络拓扑结构
| 分类   | 优点               | 缺点                 |
|--------+--------------------+----------------------|
| 总线型 | 结构简单           | 单点故障可能影响全网 |
| 星型   | 扩展方便           | 对中心节点依赖较大   |
| 树型   | 扩展方便           | 对非叶子节点依赖较大 |
| 环形   | 结构简单，扩展方便 | 单点故障可能影响全网 |
| 网状   | 扩展方便           | 冗余太多             |
*** 网络服务
向用户提供有用的网络功能，由联网的端系统中的网络应用程序通过相互协作来提供。
** 因特网
*** 组成
1. 因特网边缘
2. [[*%E6%8E%A5%E5%85%A5%E7%BD%91][接入网]]
3. 因特网核心
*** 特点
*边缘复杂，核心简单* ：遵循“端到端”的原则，即将复杂的网络处理功能置于因特网边缘，而将相对简单的分组交付功能放在因特网核心。
*优点* ：充分利用了位于因特网边缘的端系统强大的计算能力，用软件方式处理大量复杂的控制和应用逻辑，而使位于因特网核心的路由器尽可能简单，以高速地转发分组。
*** 成功的因素
在网络边缘用软件实现，方便增加新的网络功能
*** 应用程序体系结构
**** 客户/服务器体系结构 （C/S模式）
***** 服务器 
1. 运行服务器程序的主机永远在运行
2. 具有永久IP和固定端口号
3. 响应客户机程序的请求，并提供服务
***** 客户机
1. 向服务器发出请求，接收服务器响应
2. 可以间歇与服务器连接
3. 具有动态IP地址和随机端口号
4. 客户机之间不通信
**** P2P体系结构（P2P模式）
***** 特点
1. 能够借助对等方的空闲资源而不需要庞大的服务器基础设施的支持，从而降低服务提供商成本
2. P2P应用具有群组性、高度分布性和动态性
3. P2P体系结构具有自扩展性
*** 接入网
指将端系统连接到其边缘路由器的物理链路及设备的集
*** 分类
**** 从作用范围
1. 广域网 WAN
2. 局域网 LAN
3. 城域网 MAN
4. 接入网 AN
**** 从使用者
1. 专用网
2. 公用网
** 协议分层与服务模型
*** 协议 
为进行网络中的数据交换而建立的规则、标准或规约称为网络协议
**** 三要素
1. 语法：数据与控制信息的结构与格式
2. 语义：语法定义结构中的具体含义
3. 语时：事件实现顺序的详细说明
*** 分层的网络体系结构
计算机网络的各层及相应协议的集合称为网络的体系结构
**** 分层的优点
1. 简化系统设计
2. 模块化易于维护系统的更新
**** 分层的缺点
功能冗余，降低系统性能；而且分层越多，分组首部越大
*** 报文的层间传递
同一系统相邻两层的实体进行交互的地方称为服务访问点 SAP
**** 水平协议和垂直服务
1. 向上层提供服务
2. 协议是“水平的”，服务是“垂直的”
3. 向上的服务利用了下层的功能
**** 多层通信的实质
1. 对等层实体之间虚拟通信
2. 下层向上层提供服务
3. 上层使用下层提供的服务
4. 实际通信在最底层媒体完成
*** 因特网体系结构
协议数据单元PDU是OSI参考模型中对等层协议之间交换的信息单元
**** OSI（开放系统互联）参考模型
| 自顶向下   | 信息单位     |
|------------+--------------|
| 应用层     | 无           |
| 表示层     | 无           |
| 会话层     | 无           |
| 传输层     | 数据段、报文 |
| 网络层     | 分组、数据报 |
| 数据链路层 | 数据帧       |
| 物理层     | 比特         |

**** TCP/IP体系结构
***** 特点
1. 协议栈呈“沙漏型”，IP是体系结构的“细腰”，代表最小的、精选的通用功能集，能够使高层应用与底层通信网技术独立发展
2. 为了提高系统效率没有严格分层
***** 重点
1. 边缘节点必须实现TCP/IP所有五个层
2. 交换机只有两层（物理层和数据链路层）
3. 路由器只有三层（物理层，数据链路层和网络层）
***** 两个子网
1. 资源子网：应用层和运输层
2. 通信子网： 物理层，数据链路层和网络层
** 分组交换网的性能指标
*** 重要概念
**** 带宽
1. 在通信领域指信号具有的频带宽度，单位是赫兹
2. 指链路在一定时段内所能传输的比特数的额定值，常用单位时Kb/s等（十的次方）
