source/_posts/2018-02-26-computer-network.html
---
title: "计算机网络"
date: 2018-02-26
layout: post
categories: 
- notes
tags: 
- 学习笔记
published: true
comments: 
---

<div id="outline-container-org9e9a76f" class="outline-2">
<h2 id="org9e9a76f"><span class="section-number-2">1</span> 计算机网络概论</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd8c41d7" class="outline-3">
<h3 id="orgd8c41d7"><span class="section-number-3">1.1</span> 计算机网络</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org57185c4" class="outline-4">
<h4 id="org57185c4"><span class="section-number-4">1.1.1</span> 定义</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
由通信信道连接的 <b>主机和网络设备</b> 的集合，以方便用户共享资源和互相通信。
</p>
</div>
</div>
<div id="outline-container-orgad516ab" class="outline-4">
<h4 id="orgad516ab"><span class="section-number-4">1.1.2</span> 特征</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><b>最主要特征</b> 是通用性，没有对特定应用进行优化</li>
<li>能够支持广泛的、不断出现的新型应用</li>
</ul>
</div>
</div>
<div id="outline-container-orge5b9e75" class="outline-4">
<h4 id="orge5b9e75"><span class="section-number-4">1.1.3</span> 用途</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>共享信息</li>
<li>协同计算</li>
<li>方便通信</li>
<li>共享硬件</li>
</ul>
</div>
</div>
<div id="outline-container-org1ea74a0" class="outline-4">
<h4 id="org1ea74a0"><span class="section-number-4">1.1.4</span> 组成</h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<div id="outline-container-org32e502c" class="outline-5">
<h5 id="org32e502c"><span class="section-number-5">1.1.4.1</span> 称为节点的计算设备</h5>
<div class="outline-text-5" id="text-1-1-4-1">
</div>
<ol class="org-ol">
<li><a id="org2563ec7"></a>端系统（主机）<br /></li>
<li><a id="orge9f03ef"></a>中间节点<br />
<div class="outline-text-6" id="text-1-1-4-1-2">
<p>
路由器，交换机，自治系统，虚拟节点等。
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge3df912" class="outline-5">
<h5 id="orge3df912"><span class="section-number-5">1.1.4.2</span> 称为链路的物理媒体</h5>
</div>
</div>
<div id="outline-container-orgae7effa" class="outline-4">
<h4 id="orgae7effa"><span class="section-number-4">1.1.5</span> 连接方式</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li>直接连接</li>
<li>网络云</li>
<li>网络云互联</li>
</ul>
</div>
</div>
<div id="outline-container-org6a89844" class="outline-4">
<h4 id="org6a89844"><span class="section-number-4">1.1.6</span> 传递数据的方式</h4>
<div class="outline-text-4" id="text-1-1-6">
</div>
<div id="outline-container-org5a0219f" class="outline-5">
<h5 id="org5a0219f"><span class="section-number-5">1.1.6.1</span> 电路交换（电话网）</h5>
<div class="outline-text-5" id="text-1-1-6-1">
<p>
<b>基本过程</b>
</p>
<ol class="org-ol">
<li>建立连接</li>
<li>传输数据</li>
<li>连接释放</li>
</ol>

<p>
<b>优点</b> 独占资源，通信质量有保证，延迟小，无拥塞
<b>缺点</b> 建立连接时间长，工作复杂，有时工作效率低
</p>
</div>
</div>
<div id="outline-container-org061c6c8" class="outline-5">
<h5 id="org061c6c8"><span class="section-number-5">1.1.6.2</span> 分组交换（计算机网络）</h5>
<div class="outline-text-5" id="text-1-1-6-2">
<ul class="org-ul">
<li>首先采用存储转发机制</li>
<li>将长数据划分为若干短数据形成分组</li>
</ul>
<p>
以上两条为 <b>计算机网络最根本工作机制</b>
</p>
</div>
</div>
<div id="outline-container-org0780ed2" class="outline-5">
<h5 id="org0780ed2"><span class="section-number-5">1.1.6.3</span> 报文交换</h5>
<div class="outline-text-5" id="text-1-1-6-3">
<p>
<b>优点</b> 无连接，采用存储转发
<b>缺点</b> 对报文大小无限制，有时占用中间节点空间大，延时大
</p>
</div>
</div>
</div>
<div id="outline-container-org4628ee5" class="outline-4">
<h4 id="org4628ee5"><span class="section-number-4">1.1.7</span> 网络拓扑结构</h4>
<div class="outline-text-4" id="text-1-1-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">分类</th>
<th scope="col" class="org-left">优点</th>
<th scope="col" class="org-left">缺点</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">总线型</td>
<td class="org-left">结构简单</td>
<td class="org-left">单点故障可能影响全网</td>
</tr>

<tr>
<td class="org-left">星型</td>
<td class="org-left">扩展方便</td>
<td class="org-left">对中心节点依赖较大</td>
</tr>

<tr>
<td class="org-left">树型</td>
<td class="org-left">扩展方便</td>
<td class="org-left">对非叶子节点依赖较大</td>
</tr>

<tr>
<td class="org-left">环形</td>
<td class="org-left">结构简单，扩展方便</td>
<td class="org-left">单点故障可能影响全网</td>
</tr>

<tr>
<td class="org-left">网状</td>
<td class="org-left">扩展方便</td>
<td class="org-left">冗余太多</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orge7107c6" class="outline-4">
<h4 id="orge7107c6"><span class="section-number-4">1.1.8</span> 网络服务</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
向用户提供有用的网络功能，由联网的端系统中的网络应用程序通过相互协作来提供。
</p>
</div>
</div>
</div>
<div id="outline-container-org76245c3" class="outline-3">
<h3 id="org76245c3"><span class="section-number-3">1.2</span> 因特网</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgb0c05f5" class="outline-4">
<h4 id="orgb0c05f5"><span class="section-number-4">1.2.1</span> 组成</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>因特网边缘</li>
<li><a href="#org1b29d29">接入网</a></li>
<li>因特网核心</li>
</ol>
</div>
</div>
<div id="outline-container-org48d9976" class="outline-4">
<h4 id="org48d9976"><span class="section-number-4">1.2.2</span> 特点</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
<b>边缘复杂，核心简单</b> ：遵循“端到端”的原则，即将复杂的网络处理功能置于因特网边缘，而将相对简单的分组交付功能放在因特网核心。
<b>优点</b> ：充分利用了位于因特网边缘的端系统强大的计算能力，用软件方式处理大量复杂的控制和应用逻辑，而使位于因特网核心的路由器尽可能简单，以高速地转发分组。
</p>
</div>
</div>
<div id="outline-container-org3f1bc48" class="outline-4">
<h4 id="org3f1bc48"><span class="section-number-4">1.2.3</span> 成功的因素</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
在网络边缘用软件实现，方便增加新的网络功能
</p>
</div>
</div>
<div id="outline-container-org48bf890" class="outline-4">
<h4 id="org48bf890"><span class="section-number-4">1.2.4</span> 应用程序体系结构</h4>
<div class="outline-text-4" id="text-1-2-4">
</div>
<div id="outline-container-org06db79f" class="outline-5">
<h5 id="org06db79f"><span class="section-number-5">1.2.4.1</span> 客户/服务器体系结构 （C/S模式）</h5>
<div class="outline-text-5" id="text-1-2-4-1">
</div>
<ol class="org-ol">
<li><a id="org6c42ebe"></a>服务器<br />
<div class="outline-text-6" id="text-1-2-4-1-1">
<ol class="org-ol">
<li>运行服务器程序的主机永远在运行</li>
<li>具有永久IP和固定端口号</li>
<li>响应客户机程序的请求，并提供服务</li>
</ol>
</div>
</li>
<li><a id="org3c3b15a"></a>客户机<br />
<div class="outline-text-6" id="text-1-2-4-1-2">
<ol class="org-ol">
<li>向服务器发出请求，接收服务器响应</li>
<li>可以间歇与服务器连接</li>
<li>具有动态IP地址和随机端口号</li>
<li>客户机之间不通信</li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org5b99b42" class="outline-5">
<h5 id="org5b99b42"><span class="section-number-5">1.2.4.2</span> P2P体系结构（P2P模式）</h5>
<div class="outline-text-5" id="text-1-2-4-2">
</div>
<ol class="org-ol">
<li><a id="orgef76ff8"></a>特点<br />
<div class="outline-text-6" id="text-1-2-4-2-1">
<ol class="org-ol">
<li>能够借助对等方的空闲资源而不需要庞大的服务器基础设施的支持，从而降低服务提供商成本</li>
<li>P2P应用具有群组性、高度分布性和动态性</li>
<li>P2P体系结构具有自扩展性</li>
</ol>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org1b29d29" class="outline-4">
<h4 id="org1b29d29"><span class="section-number-4">1.2.5</span> 接入网</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
指将端系统连接到其边缘路由器的物理链路及设备的集
</p>
</div>
</div>
<div id="outline-container-orge028e62" class="outline-4">
<h4 id="orge028e62"><span class="section-number-4">1.2.6</span> 分类</h4>
<div class="outline-text-4" id="text-1-2-6">
</div>
<div id="outline-container-orge37c716" class="outline-5">
<h5 id="orge37c716"><span class="section-number-5">1.2.6.1</span> 从作用范围</h5>
<div class="outline-text-5" id="text-1-2-6-1">
<ol class="org-ol">
<li>广域网 WAN</li>
<li>局域网 LAN</li>
<li>城域网 MAN</li>
<li>接入网 AN</li>
</ol>
</div>
</div>
<div id="outline-container-orgfa7ee3c" class="outline-5">
<h5 id="orgfa7ee3c"><span class="section-number-5">1.2.6.2</span> 从使用者</h5>
<div class="outline-text-5" id="text-1-2-6-2">
<ol class="org-ol">
<li>专用网</li>
<li>公用网</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orgafa5802" class="outline-3">
<h3 id="orgafa5802"><span class="section-number-3">1.3</span> 协议分层与服务模型</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org23c3ae7" class="outline-4">
<h4 id="org23c3ae7"><span class="section-number-4">1.3.1</span> 协议</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
为进行网络中的数据交换而建立的规则、标准或规约称为网络协议
</p>
</div>
<div id="outline-container-orgdb0097e" class="outline-5">
<h5 id="orgdb0097e"><span class="section-number-5">1.3.1.1</span> 三要素</h5>
<div class="outline-text-5" id="text-1-3-1-1">
<ol class="org-ol">
<li>语法：数据与控制信息的结构与格式</li>
<li>语义：语法定义结构中的具体含义</li>
<li>语时：事件实现顺序的详细说明</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgcc051f5" class="outline-4">
<h4 id="orgcc051f5"><span class="section-number-4">1.3.2</span> 分层的网络体系结构</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
计算机网络的各层及相应协议的集合称为网络的体系结构
</p>
</div>
<div id="outline-container-org0587617" class="outline-5">
<h5 id="org0587617"><span class="section-number-5">1.3.2.1</span> 分层的优点</h5>
<div class="outline-text-5" id="text-1-3-2-1">
<ol class="org-ol">
<li>简化系统设计</li>
<li>模块化易于维护系统的更新</li>
</ol>
</div>
</div>
<div id="outline-container-org2098dae" class="outline-5">
<h5 id="org2098dae"><span class="section-number-5">1.3.2.2</span> 分层的缺点</h5>
<div class="outline-text-5" id="text-1-3-2-2">
<p>
功能冗余，降低系统性能；而且分层越多，分组首部越大
</p>
</div>
</div>
</div>
<div id="outline-container-orgf74b514" class="outline-4">
<h4 id="orgf74b514"><span class="section-number-4">1.3.3</span> 报文的层间传递</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
同一系统相邻两层的实体进行交互的地方称为服务访问点 SAP
</p>
</div>
<div id="outline-container-org19a22dd" class="outline-5">
<h5 id="org19a22dd"><span class="section-number-5">1.3.3.1</span> 水平协议和垂直服务</h5>
<div class="outline-text-5" id="text-1-3-3-1">
<ol class="org-ol">
<li>向上层提供服务</li>
<li>协议是“水平的”，服务是“垂直的”</li>
<li>向上的服务利用了下层的功能</li>
</ol>
</div>
</div>
<div id="outline-container-orga8b457a" class="outline-5">
<h5 id="orga8b457a"><span class="section-number-5">1.3.3.2</span> 多层通信的实质</h5>
<div class="outline-text-5" id="text-1-3-3-2">
<ol class="org-ol">
<li>对等层实体之间虚拟通信</li>
<li>下层向上层提供服务</li>
<li>上层使用下层提供的服务</li>
<li>实际通信在最底层媒体完成</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org6491206" class="outline-4">
<h4 id="org6491206"><span class="section-number-4">1.3.4</span> 因特网体系结构</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
协议数据单元PDU是OSI参考模型中对等层协议之间交换的信息单元
</p>
</div>
<div id="outline-container-org0c0efd4" class="outline-5">
<h5 id="org0c0efd4"><span class="section-number-5">1.3.4.1</span> OSI（开放系统互联）参考模型</h5>
<div class="outline-text-5" id="text-1-3-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">自顶向下</th>
<th scope="col" class="org-left">信息单位</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">应用层</td>
<td class="org-left">无</td>
</tr>

<tr>
<td class="org-left">表示层</td>
<td class="org-left">无</td>
</tr>

<tr>
<td class="org-left">会话层</td>
<td class="org-left">无</td>
</tr>

<tr>
<td class="org-left">传输层</td>
<td class="org-left">数据段、报文</td>
</tr>

<tr>
<td class="org-left">网络层</td>
<td class="org-left">分组、数据报</td>
</tr>

<tr>
<td class="org-left">数据链路层</td>
<td class="org-left">数据帧</td>
</tr>

<tr>
<td class="org-left">物理层</td>
<td class="org-left">比特</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7897127" class="outline-5">
<h5 id="org7897127"><span class="section-number-5">1.3.4.2</span> TCP/IP体系结构</h5>
<div class="outline-text-5" id="text-1-3-4-2">
</div>
<ol class="org-ol">
<li><a id="org831f6f4"></a>特点<br />
<div class="outline-text-6" id="text-1-3-4-2-1">
<ol class="org-ol">
<li>协议栈呈“沙漏型”，IP是体系结构的“细腰”，代表最小的、精选的通用功能集，能够使高层应用与底层通信网技术独立发展</li>
<li>为了提高系统效率没有严格分层</li>
</ol>
</div>
</li>
<li><a id="orgcb91420"></a>重点<br />
<div class="outline-text-6" id="text-1-3-4-2-2">
<ol class="org-ol">
<li>边缘节点必须实现TCP/IP所有五个层</li>
<li>交换机只有两层（物理层和数据链路层）</li>
<li>路由器只有三层（物理层，数据链路层和网络层）</li>
</ol>
</div>
</li>
<li><a id="orgfd7aff1"></a>两个子网<br />
<div class="outline-text-6" id="text-1-3-4-2-3">
<ol class="org-ol">
<li>资源子网：应用层和运输层</li>
<li>通信子网： 物理层，数据链路层和网络层</li>
</ol>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org056f021" class="outline-3">
<h3 id="org056f021"><span class="section-number-3">1.4</span> 分组交换网的性能指标</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org49cddd6" class="outline-4">
<h4 id="org49cddd6"><span class="section-number-4">1.4.1</span> 重要概念</h4>
<div class="outline-text-4" id="text-1-4-1">
</div>
<div id="outline-container-org64cd3e4" class="outline-5">
<h5 id="org64cd3e4"><span class="section-number-5">1.4.1.1</span> 带宽</h5>
<div class="outline-text-5" id="text-1-4-1-1">
<ol class="org-ol">
<li>在通信领域指信号具有的频带宽度，单位是赫兹</li>
<li>指链路在一定时段内所能传输的比特数的额定值，常用单位时Kb/s等（十的次方）</li>
</ol>
</div>
</div>
