source/blog/2018-02-26-computer-network.org
**** 时延
1. 处理时延
2. 排队时延
3. 传输时延（等于分组长度除以链路带宽）
4. 传播时延（等于节点间距离除以传播速度）

* 数据通信基础
** 数据通信基础知识
*** 通信系统模型
*通信的目的* 是用电信手段传递报文中的信息。 *通信系统* 的作用就是将信息从 *信源* 发送到一个或多个 *信宿* 。
**** 组成 
信源，发送设备，信道，接收设备，信宿
*** 数字通信及其性质
*数据* 是运输信息的实体， *信号* 是数据的电气或电磁表现。 *数据是针对信息而言的，而信号则是针对传输而言的* 
**** 数字信号和模拟信号
前者是离散的，后者是连续的。将数字信号转化为模拟信号的过程称为 *调制* ，反之称为 *解调制* 。
*****  数字信号 
基本单位是 *码元* 。数字通信具有抗干扰能力强且噪声不积累，传输差错可控，便于对数字信息进行处理、变换、存储，易于复用和易加密处理等优点。
***** 奈奎斯特公式
C=2W log_2 M bps
（低通带“2”，带通不带“2”,W为信道带宽，M为信号状态数量）
***** 香农公式 
C=W log_2 (1+S/N) bps
（W为信道带宽，S为信道内所传信号的平均功率，N为信道内部的高斯噪声功率）
*** 通信方式
**** 三种基本方式
1. 单工通信：只能单方向传输报文
2. 半双工通信：能够收发报文，但不能同时进行
3. 全双工通信：能够同时收发报文
**** 两种信号
*基带* 信号和 *宽带* 信号
** 传输媒体
*** 物理层基本概念
主要任务为确定与传输媒体的接口的一些特性
**** 机械特性
指明接口所用接线器的形状和尺寸、引线数目和排列、固定和锁定装置等
**** 电气特性
指明在接口电缆的各条线上出现的电压的范围
**** 功能特性
指明某条线上出现的某一种电平的电压表示何种意义
**** 规程特性
指明对于不同功能的各种可能事件的出现顺序
*** 导向传输媒体
**** 双绞线
**** 光纤
由光缆、光源和检测器组成
**** 同轴电缆
1. 粗缆：10BASE5（表示10M基带，最长500米）
2. 细缆：10BASE2
3. 100BASEF，100BASEB（F表示光纤，B表示宽带）
*** 非导向传输媒体
微波，卫星和无线电
** 编码和复用
*** 编码
为了使信道能有效地传输信号，并且接收节点能够有效地识别发送节点发送的比特， *首先要将比特编码为信号* ，然后再在媒体上进行传输。
**** 不归零（NRZ）
将比特数值1映射为高电平信号，数值0映射为低电平信号。但连续的1或0会带来两个问题。
1. 基线漂移：连续的1或0影响信号平均值，从而难以检测出信号变化
2. 时钟恢复：发送方和接收方不能同步时钟，无法正确对信号进行解码
**** 不归零反转（NRZI）
将当前信号的一个跳变编码为一个1,将保持当前信号编码为0（只解决了连续1的问题，没有解决连续0的问题）
**** 曼彻斯特编码
通过传输NRZ编码数据与时钟的异或合并了时钟和信号

*** 多路复用
指在一条物理链路上同时传输多路信息，以扩大信道的传输容量的技术。
1. 频分复用（FDM）
2. 时分复用（TDM）
3. 波分复用（WDM）
4. 码分复用（CDM）又称码分多址（CMDA）

CMDA中将每一个比特时间再划分为m比特的序列，称为 *码片* 。CMDA给每个节点分配的码片序列各不相同，并且相互正交。
1) 任意两个不同节点的码片向量规格化内积为0
2) 任意一个码片向量和自己的规格化内积为1
3) 任意一个码片向量和自己反码向量规格化内积为-1
** 交换技术
*** [[*%E7%94%B5%E8%B7%AF%E4%BA%A4%E6%8D%A2%EF%BC%88%E7%94%B5%E8%AF%9D%E7%BD%91%EF%BC%89][电路交换（电话网）]]和[[*%E6%8A%A5%E6%96%87%E4%BA%A4%E6%8D%A2][报文交换]] 
*** [[*%E5%88%86%E7%BB%84%E4%BA%A4%E6%8D%A2%EF%BC%88%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C%EF%BC%89][分组交换（计算机网络）]]
** 数字传输技术
*** PCM及其复用
为将模拟信号转变为数字信号，PCM（脉码调制）先要对模拟信号进行采样。
根据 *采样原理* ，采样频率不能低于信号最高频率两倍。
*** 同步数字系列SDH 
1. 统一复用的传输速率标准
2. 采用同步传输技术
* 直接连接的网络
数据链路层必须处理的四个基础性问题：
- 成帧
- 差错检测和纠正
- 可靠数据传输
- 多路访问

** 链路层概述
*链路层的任务* 将上层交付的数据报通过单段链路从一个节点传输到相邻的节
 点 
*** 网络链路的类型
- 点到点链路
- 广播链路
*** 链路层功能在哪里完成？
网络适配器和节点的驱动程序

** 成帧 
*** 面向比特的协议
把帧看成比特的集合，使用 *比特填充*  解决帧结构不完整的问题
*** 面向字节的协议
把帧看成字节的集合，使用 *字符填充法* 解决协议中某些字段长度不固定的问
题
*** PPP
点到点协议
** 差错检测和纠错技术
两种方法处理帧出现的差错：
- 检错重传
- 前向纠错
*** 奇偶检验
二维奇偶检验
*** 检验和方法
互联网校验和
*** 循环冗余检验
** 可靠数据传输原理
*** 流水线可靠数据传输协议（连续ARQ）
*** 回退N步协议（滑动窗口协议） GBN
*** 选择重传协议 SR
** 多路访问
协调多个发送节点和接收节点访问同一个公共信道
*** 信道划分协议
- 时分多路复用
- 频分多路复用
- 码分多址
*** 轮流协议
**** IEEE 802.5 令牌环
具有优先级处理机制；令牌是一种用于控制目的的帧
***** 工作状态
****** 发送方式
1. 截获令牌
2. 回收发出的帧
3. 产生新的令牌

****** 接收方式
