source/_posts/2018-02-26-computer-network.html
<div id="outline-container-org8b26eca" class="outline-5">
<h5 id="org8b26eca"><span class="section-number-5">1.4.1.2</span> 时延</h5>
<div class="outline-text-5" id="text-1-4-1-2">
<ol class="org-ol">
<li>处理时延</li>
<li>排队时延</li>
<li>传输时延（等于分组长度除以链路带宽）</li>
<li>传播时延（等于节点间距离除以传播速度）</li>
</ol>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5bd1361" class="outline-2">
<h2 id="org5bd1361"><span class="section-number-2">2</span> 数据通信基础</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd6e0fb1" class="outline-3">
<h3 id="orgd6e0fb1"><span class="section-number-3">2.1</span> 数据通信基础知识</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org70e25ae" class="outline-4">
<h4 id="org70e25ae"><span class="section-number-4">2.1.1</span> 通信系统模型</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<b>通信的目的</b> 是用电信手段传递报文中的信息。 <b>通信系统</b> 的作用就是将信息从 <b>信源</b> 发送到一个或多个 <b>信宿</b> 。
</p>
</div>
<div id="outline-container-orgb29d0dc" class="outline-5">
<h5 id="orgb29d0dc"><span class="section-number-5">2.1.1.1</span> 组成</h5>
<div class="outline-text-5" id="text-2-1-1-1">
<p>
信源，发送设备，信道，接收设备，信宿
</p>
</div>
</div>
</div>
<div id="outline-container-org8dc37d0" class="outline-4">
<h4 id="org8dc37d0"><span class="section-number-4">2.1.2</span> 数字通信及其性质</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<b>数据</b> 是运输信息的实体， <b>信号</b> 是数据的电气或电磁表现。 <b>数据是针对信息而言的，而信号则是针对传输而言的</b> 
</p>
</div>
<div id="outline-container-orgaf84f6d" class="outline-5">
<h5 id="orgaf84f6d"><span class="section-number-5">2.1.2.1</span> 数字信号和模拟信号</h5>
<div class="outline-text-5" id="text-2-1-2-1">
<p>
前者是离散的，后者是连续的。将数字信号转化为模拟信号的过程称为 <b>调制</b> ，反之称为 <b>解调制</b> 。
</p>
</div>
<ol class="org-ol">
<li><a id="orgd473409"></a>数字信号<br />
<div class="outline-text-6" id="text-2-1-2-1-1">
<p>
基本单位是 <b>码元</b> 。数字通信具有抗干扰能力强且噪声不积累，传输差错可控，便于对数字信息进行处理、变换、存储，易于复用和易加密处理等优点。
</p>
</div>
</li>
<li><a id="org7e24a0f"></a>奈奎斯特公式<br />
<div class="outline-text-6" id="text-2-1-2-1-2">
<p>
C=2W log<sub>2</sub> M bps
（低通带“2”，带通不带“2”,W为信道带宽，M为信号状态数量）
</p>
</div>
</li>
<li><a id="org972a01a"></a>香农公式<br />
<div class="outline-text-6" id="text-2-1-2-1-3">
<p>
C=W log<sub>2</sub> (1+S/N) bps
（W为信道带宽，S为信道内所传信号的平均功率，N为信道内部的高斯噪声功率）
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgb4f29dc" class="outline-4">
<h4 id="orgb4f29dc"><span class="section-number-4">2.1.3</span> 通信方式</h4>
<div class="outline-text-4" id="text-2-1-3">
</div>
<div id="outline-container-orgcdad9fa" class="outline-5">
<h5 id="orgcdad9fa"><span class="section-number-5">2.1.3.1</span> 三种基本方式</h5>
<div class="outline-text-5" id="text-2-1-3-1">
<ol class="org-ol">
<li>单工通信：只能单方向传输报文</li>
<li>半双工通信：能够收发报文，但不能同时进行</li>
<li>全双工通信：能够同时收发报文</li>
</ol>
</div>
</div>
<div id="outline-container-orgd430432" class="outline-5">
<h5 id="orgd430432"><span class="section-number-5">2.1.3.2</span> 两种信号</h5>
<div class="outline-text-5" id="text-2-1-3-2">
<p>
<b>基带</b> 信号和 <b>宽带</b> 信号
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org9b4aabe" class="outline-3">
<h3 id="org9b4aabe"><span class="section-number-3">2.2</span> 传输媒体</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgdbc8659" class="outline-4">
<h4 id="orgdbc8659"><span class="section-number-4">2.2.1</span> 物理层基本概念</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
主要任务为确定与传输媒体的接口的一些特性
</p>
</div>
<div id="outline-container-orga2abd6e" class="outline-5">
<h5 id="orga2abd6e"><span class="section-number-5">2.2.1.1</span> 机械特性</h5>
<div class="outline-text-5" id="text-2-2-1-1">
<p>
指明接口所用接线器的形状和尺寸、引线数目和排列、固定和锁定装置等
</p>
</div>
</div>
<div id="outline-container-orgb4dc0bf" class="outline-5">
<h5 id="orgb4dc0bf"><span class="section-number-5">2.2.1.2</span> 电气特性</h5>
<div class="outline-text-5" id="text-2-2-1-2">
<p>
指明在接口电缆的各条线上出现的电压的范围
</p>
</div>
</div>
<div id="outline-container-org5974638" class="outline-5">
<h5 id="org5974638"><span class="section-number-5">2.2.1.3</span> 功能特性</h5>
<div class="outline-text-5" id="text-2-2-1-3">
<p>
指明某条线上出现的某一种电平的电压表示何种意义
</p>
</div>
</div>
<div id="outline-container-orgc7b2e77" class="outline-5">
<h5 id="orgc7b2e77"><span class="section-number-5">2.2.1.4</span> 规程特性</h5>
<div class="outline-text-5" id="text-2-2-1-4">
<p>
指明对于不同功能的各种可能事件的出现顺序
</p>
</div>
</div>
</div>
<div id="outline-container-orgb0cf9b2" class="outline-4">
<h4 id="orgb0cf9b2"><span class="section-number-4">2.2.2</span> 导向传输媒体</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<div id="outline-container-org50928a8" class="outline-5">
<h5 id="org50928a8"><span class="section-number-5">2.2.2.1</span> 双绞线</h5>
</div>
<div id="outline-container-orgef4d8a2" class="outline-5">
<h5 id="orgef4d8a2"><span class="section-number-5">2.2.2.2</span> 光纤</h5>
<div class="outline-text-5" id="text-2-2-2-2">
<p>
由光缆、光源和检测器组成
</p>
</div>
</div>
<div id="outline-container-orgc72fda2" class="outline-5">
<h5 id="orgc72fda2"><span class="section-number-5">2.2.2.3</span> 同轴电缆</h5>
<div class="outline-text-5" id="text-2-2-2-3">
<ol class="org-ol">
<li>粗缆：10BASE5（表示10M基带，最长500米）</li>
<li>细缆：10BASE2</li>
<li>100BASEF，100BASEB（F表示光纤，B表示宽带）</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc0ebeb1" class="outline-4">
<h4 id="orgc0ebeb1"><span class="section-number-4">2.2.3</span> 非导向传输媒体</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
微波，卫星和无线电
</p>
</div>
</div>
</div>
<div id="outline-container-orgc5c9b43" class="outline-3">
<h3 id="orgc5c9b43"><span class="section-number-3">2.3</span> 编码和复用</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org7ade63f" class="outline-4">
<h4 id="org7ade63f"><span class="section-number-4">2.3.1</span> 编码</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
为了使信道能有效地传输信号，并且接收节点能够有效地识别发送节点发送的比特， <b>首先要将比特编码为信号</b> ，然后再在媒体上进行传输。
</p>
</div>
<div id="outline-container-org7a7ad24" class="outline-5">
<h5 id="org7a7ad24"><span class="section-number-5">2.3.1.1</span> 不归零（NRZ）</h5>
<div class="outline-text-5" id="text-2-3-1-1">
<p>
将比特数值1映射为高电平信号，数值0映射为低电平信号。但连续的1或0会带来两个问题。
</p>
<ol class="org-ol">
<li>基线漂移：连续的1或0影响信号平均值，从而难以检测出信号变化</li>
<li>时钟恢复：发送方和接收方不能同步时钟，无法正确对信号进行解码</li>
</ol>
</div>
</div>
<div id="outline-container-org850e1ac" class="outline-5">
<h5 id="org850e1ac"><span class="section-number-5">2.3.1.2</span> 不归零反转（NRZI）</h5>
<div class="outline-text-5" id="text-2-3-1-2">
<p>
将当前信号的一个跳变编码为一个1,将保持当前信号编码为0（只解决了连续1的问题，没有解决连续0的问题）
</p>
</div>
</div>
<div id="outline-container-org12dc865" class="outline-5">
<h5 id="org12dc865"><span class="section-number-5">2.3.1.3</span> 曼彻斯特编码</h5>
<div class="outline-text-5" id="text-2-3-1-3">
<p>
通过传输NRZ编码数据与时钟的异或合并了时钟和信号
</p>
</div>
</div>
</div>

<div id="outline-container-orge6fa781" class="outline-4">
<h4 id="orge6fa781"><span class="section-number-4">2.3.2</span> 多路复用</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
指在一条物理链路上同时传输多路信息，以扩大信道的传输容量的技术。
</p>
<ol class="org-ol">
<li>频分复用（FDM）</li>
<li>时分复用（TDM）</li>
<li>波分复用（WDM）</li>
<li>码分复用（CDM）又称码分多址（CMDA）</li>
</ol>

<p>
CMDA中将每一个比特时间再划分为m比特的序列，称为 <b>码片</b> 。CMDA给每个节点分配的码片序列各不相同，并且相互正交。
</p>
<ol class="org-ol">
<li>任意两个不同节点的码片向量规格化内积为0</li>
<li>任意一个码片向量和自己的规格化内积为1</li>
<li>任意一个码片向量和自己反码向量规格化内积为-1</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgdf4adb5" class="outline-3">
<h3 id="orgdf4adb5"><span class="section-number-3">2.4</span> 交换技术</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org29d7abc" class="outline-4">
<h4 id="org29d7abc"><span class="section-number-4">2.4.1</span> <a href="#org5a0219f">电路交换（电话网）</a>和<a href="#org0780ed2">报文交换</a></h4>
</div>
<div id="outline-container-org7b5b599" class="outline-4">
<h4 id="org7b5b599"><span class="section-number-4">2.4.2</span> <a href="#org061c6c8">分组交换（计算机网络）</a></h4>
</div>
</div>
<div id="outline-container-org52500a9" class="outline-3">
<h3 id="org52500a9"><span class="section-number-3">2.5</span> 数字传输技术</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org5ff18dc" class="outline-4">
<h4 id="org5ff18dc"><span class="section-number-4">2.5.1</span> PCM及其复用</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
为将模拟信号转变为数字信号，PCM（脉码调制）先要对模拟信号进行采样。
根据 <b>采样原理</b> ，采样频率不能低于信号最高频率两倍。
</p>
</div>
</div>
<div id="outline-container-orgebe1275" class="outline-4">
<h4 id="orgebe1275"><span class="section-number-4">2.5.2</span> 同步数字系列SDH</h4>
<div class="outline-text-4" id="text-2-5-2">
<ol class="org-ol">
<li>统一复用的传输速率标准</li>
<li>采用同步传输技术</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc5cf6a9" class="outline-2">
<h2 id="orgc5cf6a9"><span class="section-number-2">3</span> 直接连接的网络</h2>
<div class="outline-text-2" id="text-3">
<p>
数据链路层必须处理的四个基础性问题：
</p>
<ul class="org-ul">
<li>成帧</li>
<li>差错检测和纠正</li>
<li>可靠数据传输</li>
<li>多路访问</li>
</ul>
</div>

<div id="outline-container-org46be1d2" class="outline-3">
<h3 id="org46be1d2"><span class="section-number-3">3.1</span> 链路层概述</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>链路层的任务</b> 将上层交付的数据报通过单段链路从一个节点传输到相邻的节
 点 
</p>
</div>
<div id="outline-container-org9bf42e6" class="outline-4">
<h4 id="org9bf42e6"><span class="section-number-4">3.1.1</span> 网络链路的类型</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>点到点链路</li>
<li>广播链路</li>
</ul>
</div>
</div>
<div id="outline-container-org798ddc2" class="outline-4">
<h4 id="org798ddc2"><span class="section-number-4">3.1.2</span> 链路层功能在哪里完成？</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
网络适配器和节点的驱动程序
</p>
</div>
</div>
</div>

<div id="outline-container-orgec57272" class="outline-3">
<h3 id="orgec57272"><span class="section-number-3">3.2</span> 成帧</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orga0d0d04" class="outline-4">
<h4 id="orga0d0d04"><span class="section-number-4">3.2.1</span> 面向比特的协议</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
把帧看成比特的集合，使用 <b>比特填充</b>  解决帧结构不完整的问题
</p>
</div>
</div>
<div id="outline-container-orgbb293ab" class="outline-4">
<h4 id="orgbb293ab"><span class="section-number-4">3.2.2</span> 面向字节的协议</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
把帧看成字节的集合，使用 <b>字符填充法</b> 解决协议中某些字段长度不固定的问
题
</p>
</div>
</div>
<div id="outline-container-org2be3889" class="outline-4">
<h4 id="org2be3889"><span class="section-number-4">3.2.3</span> PPP</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
点到点协议
</p>
</div>
</div>
</div>
<div id="outline-container-org8ac8563" class="outline-3">
<h3 id="org8ac8563"><span class="section-number-3">3.3</span> 差错检测和纠错技术</h3>
<div class="outline-text-3" id="text-3-3">
<p>
两种方法处理帧出现的差错：
</p>
<ul class="org-ul">
<li>检错重传</li>
<li>前向纠错</li>
</ul>
</div>
<div id="outline-container-orga1129ee" class="outline-4">
<h4 id="orga1129ee"><span class="section-number-4">3.3.1</span> 奇偶检验</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
二维奇偶检验
</p>
</div>
</div>
<div id="outline-container-org580ce3e" class="outline-4">
<h4 id="org580ce3e"><span class="section-number-4">3.3.2</span> 检验和方法</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
互联网校验和
</p>
</div>
</div>
<div id="outline-container-orge6eb651" class="outline-4">
<h4 id="orge6eb651"><span class="section-number-4">3.3.3</span> 循环冗余检验</h4>
</div>
</div>
<div id="outline-container-orga360b24" class="outline-3">
<h3 id="orga360b24"><span class="section-number-3">3.4</span> 可靠数据传输原理</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orge2bb6d4" class="outline-4">
<h4 id="orge2bb6d4"><span class="section-number-4">3.4.1</span> 流水线可靠数据传输协议（连续ARQ）</h4>
</div>
<div id="outline-container-orgf454234" class="outline-4">
<h4 id="orgf454234"><span class="section-number-4">3.4.2</span> 回退N步协议（滑动窗口协议） GBN</h4>
</div>
<div id="outline-container-orge84c0ec" class="outline-4">
<h4 id="orge84c0ec"><span class="section-number-4">3.4.3</span> 选择重传协议 SR</h4>
</div>
</div>
<div id="outline-container-orgdedcdf1" class="outline-3">
<h3 id="orgdedcdf1"><span class="section-number-3">3.5</span> 多路访问</h3>
<div class="outline-text-3" id="text-3-5">
<p>
协调多个发送节点和接收节点访问同一个公共信道
</p>
</div>
<div id="outline-container-orgeb1b5f6" class="outline-4">
<h4 id="orgeb1b5f6"><span class="section-number-4">3.5.1</span> 信道划分协议</h4>
<div class="outline-text-4" id="text-3-5-1">
<ul class="org-ul">
<li>时分多路复用</li>
<li>频分多路复用</li>
<li>码分多址</li>
</ul>
</div>
</div>
<div id="outline-container-orgd0670a2" class="outline-4">
<h4 id="orgd0670a2"><span class="section-number-4">3.5.2</span> 轮流协议</h4>
<div class="outline-text-4" id="text-3-5-2">
</div>
<div id="outline-container-orgf03d73e" class="outline-5">
<h5 id="orgf03d73e"><span class="section-number-5">3.5.2.1</span> IEEE 802.5 令牌环</h5>
<div class="outline-text-5" id="text-3-5-2-1">
<p>
具有优先级处理机制；令牌是一种用于控制目的的帧
</p>
</div>
<ol class="org-ol">
